{
  "articles": [
    {
      "link": "https://coingape.com/markets/solana-price-defends-140-as-sols-pumpfun-flips-ethereum-in-fees/",
      "title": "Solana Price Defends $140 as SOL’s PumpFun Flips Ethereum in Fees",
      "updatedAt": "May 6 2025, 1:00 PM GMT",
      "content": "Solana price defends the $140 support level after the PumpFun meme coin launchpad overtook Ethereum in yearly fees. \n\n Solana price is defending a critical support level at $140 after the SOL-based meme coin launchpad PumpFun overtook Ethereum in yearly fees. This scenario has seen investors speculate about whether SOL can reach an all-time high of $300 soon, considering that a spike in meme token activity has previously fuelled its gains. Solana Price Today as $140 Support Holds \n SOL value today trades at $143 with a modest 1% decline in 24 hours as the broader crypto market bowed to bearish pressure after Bitcoin fell below $95,000. Despite the surge in volatility, this top altcoin has successfully defended the support level at $140, a sign that it may record a strong bounce to the upside if buyers step in. Looking at the previous trends, this support level has often determined the next trajectory for the price of Solana. Whenever this level held, SOL posted a strong bounce while a break out below has triggered a massive downtrend, with the recent being a fall to around $105. \n The trend this time around may be a strong upside after a surge in meme coin activity that may precede notable gains in the price. SOL’s PumpFun Overtakes Ethereum in Fees \n The PumpFun meme coin launchpad has overtaken Ethereum in fees, a factor that supports a bullish Solana price prediction. Data from Tokenterminal shows that the year-to-date fees on Ethereum stand at $248 million, which is notably lower compared to the $294 million in fees recorded on PumpFun.This data shows that meme coin activity on PumpFun is outpacing the decentralized application (dApp) activity on Ethereum, which is a bullish indicator for the Solana price. Surging meme coin activity also saw SOL overtake Ethereum in DEX activity last month, with $70 billion volumes compared to ETH’s $56 billion, according to data from DeFiLlama. SOL Short-Term Forecast \n Despite the surge in blockchain activity and the forecast that a Solana price rally to $300 is imminent, the short-term forecast remains bearish, with technical indicators showing that a reversal from bullish to bearish trends is about to occur. \n The MACD indicator has created a sell signal after crossing below the signal line, a sign that downward pressure is about to commence. The RSI is also tipping south after forming a higher low. If this metric crumbles below 50, it will confirm that the momentum is now bearish and may push SOL to as low as $112. However, if traders step in to buy Solana now because of the positive sentiment caused by the surging blockchain activity, then it is likely for the SOL price to defend support at $139 and aim for the resistance level at $180. Crossing this resistance level could spark massive gains for the altcoin and see it outperform Ethereum."
    }
  ]
}
